# 向字典添加新内容的方法是增加新键/值对，修改或删除已有键/值对
student={'小萌':'1001','小智':'1002','小强':'1003'}
# 更新小强的学号
student['小强']='1005'
print('小强的学号是:%s' %student['小强'])
# 增加一个键值对，小张
student['小张']='1006'
print("增加一个键值对张之后的字典为：%s"%student)
print('小张的学号是:%s' %student['小张'])

# 删除字典元素
student={'小强':'1005','小萌':'1001','小智':'1002','小张':'1006'}
print('删除前：',student)
del student['小张']
print('删除后：',student)
#
# #删除这个字典
# student={'小强':'1005','小萌':'1001','小智':'1002','小张':'1006'}
# print('删除前：',student)
# del student
# # 删除整个字典之后字典就不能被访问了
#
